rails_api/app/controllers/api/v1/sessions_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? ORDER BY "users"."id" ASC LIMIT ?  [["email", "johnsnow@gmail.com"], ["LIMIT", 1]]
---
  def load_user
    @user = User.find_for_database_authentication(email: sign_in_params[:email])

SELECT "users".* FROM "users" WHERE "users"."authentication_token" = ? LIMIT ?  [["authentication_token", "rY99QnR8vNYbp5exJ7rT"], ["LIMIT", 1]]
---
  def valid_token
    @user = User.find_by authentication_token: request.headers["AUTH-TOKEN"]